# ApplicableTotalLengthRoundingMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarRoundingManager..::..ApplicableTotalLengthRoundingMethod Property
RebarRoundingManager Class See Also
---
The applicable rounding method for Bar Length and Total Bar Length parameters.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RoundingMethod ApplicableTotalLengthRoundingMethod { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicableTotalLengthRoundingMethod As RoundingMethod
	Get
```

Visual C++
---
```text
public:
property RoundingMethod ApplicableTotalLengthRoundingMethod {
	RoundingMethod get ();
}
```

# Remarks
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
# See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace